{
  "irVersion": "1.0",
  "project": "agentkit",
  "repository": "https://github.com/plexusone/agentkit",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.5.0",
      "date": "2026-03-01",
      "highlights": [
        { "description": "Organization rename from agentplexus to plexusone" }
      ],
      "changed": [
        { "description": "**Breaking**: Module path changed from `github.com/agentplexus/agentkit` to `github.com/plexusone/agentkit`" }
      ],
      "dependencies": [
        { "description": "Upgraded `github.com/plexusone/opik-go` to v0.6.0 (renamed from go-opik)" },
        { "description": "Upgraded `github.com/plexusone/phoenix-go` to v0.2.0 (renamed from go-phoenix)" },
        { "description": "Upgraded `github.com/plexusone/omnillm` to v0.12.0" },
        { "description": "Upgraded `github.com/plexusone/omniobserve` to v0.7.0" },
        { "description": "Upgraded `github.com/plexusone/omnivault` to v0.3.0" },
        { "description": "Upgraded `github.com/plexusone/vaultguard` to v0.3.0" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-02-02",
      "highlights": [
        { "description": "Model Context Protocol (MCP) server for AI assistant tool integration" },
        { "description": "Local development platform for CLI-based agent testing" }
      ],
      "added": [
        { "description": "MCP server implementation with JSON-RPC 2.0 protocol and stdio transport (`mcp/server.go`, `mcp/protocol.go`)", "commit": "cb47e55" },
        { "description": "Local development platform with interactive CLI, file system tools, and bash execution (`platforms/local/`)", "commit": "492b59d" }
      ],
      "changed": [
        { "description": "Update LLM integration for new OmniLLM and OmniObserve APIs", "commit": "b5beda7" }
      ],
      "documentation": [
        { "description": "Update AgentCore platform documentation", "commit": "1a8468c" },
        { "description": "Add SVG icon", "commit": "f7090d4" },
        { "description": "Add icon with transparent background", "commit": "fde15ea" }
      ],
      "infrastructure": [
        { "description": "Update Go versions in CI workflow", "commit": "607ee24" }
      ],
      "dependencies": [
        { "description": "Upgrade `google.golang.org/adk` 0.3.0 → 0.4.0", "commit": "784cd47" },
        { "description": "Upgrade `github.com/cloudwego/eino` 0.7.17 → 0.7.29", "commit": "599ece2" },
        { "description": "Upgrade `google.golang.org/genai` 1.42.0 → 1.44.0", "commit": "599ece2" },
        { "description": "Upgrade `github.com/a2aproject/a2a-go` 0.3.4 → 0.3.6", "commit": "599ece2" },
        { "description": "Upgrade `github.com/agentplexus/omnivault` 0.2.0 → 0.2.1", "commit": "34d7309" },
        { "description": "Upgrade `github.com/agentplexus/omniobserve` 0.5.0 → 0.5.1", "commit": "d4b35ca" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-04",
      "added": [
        { "description": "OmniVault integration for unified secret management (`config/omnivault.go`)" },
        { "description": "Config file loading from JSON/YAML (`config/file.go`)" },
        { "description": "`Load(ctx, LoadOptions)` function for unified config loading" },
        { "description": "`SecretsClient` type with support for `env`, `aws-sm`, `aws-ssm`, `memory` providers" },
        { "description": "Auto-detection of AWS environment (ECS, Lambda, EC2)" },
        { "description": "`ConfigFile` struct for structured configuration from config.json" },
        { "description": "`GetSecret(ctx, name)` method on Config for secret retrieval" },
        { "description": "Protocol configuration for agents (`HTTP`, `MCP`, `A2A`)" },
        { "description": "Authorization configuration (`AuthorizerConfig` type)" },
        { "description": "Memory support for stateful agents (`EnableMemory` field)" },
        { "description": "Gateway configuration for multi-agent routing (`GatewayConfig` type)" }
      ],
      "changed": [
        { "description": "`SecureConfig` now supports OmniVault as primary secrets source" },
        { "description": "Added `WithSecretsProvider()`, `WithAWSSecretsManager()`, `WithAutoSecretsProvider()` options" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2025-12-31",
      "added": [
        { "description": "IaC configuration package for AgentCore deployments" }
      ],
      "changed": [
        { "description": "Bump `github.com/agentplexus/vaultguard` from 0.1.0 to 0.2.0" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-12-29",
      "added": [
        { "description": "Initial release with core agent framework" },
        { "description": "A2A protocol server factory" },
        { "description": "HTTP server factory" },
        { "description": "Multi-provider LLM abstraction (Gemini, Claude, OpenAI, xAI, Ollama)" },
        { "description": "Eino workflow orchestration integration" },
        { "description": "AWS Bedrock AgentCore runtime support" },
        { "description": "Kubernetes + Helm deployment support" },
        { "description": "VaultGuard credential management integration" },
        { "description": "Configuration management utilities" }
      ],
      "changed": [
        { "description": "Bump `github.com/cloudwego/eino` from 0.7.14 to 0.7.15" }
      ],
      "fixed": [
        { "description": "Remove unused error return from `loadSecureCredentials`" }
      ]
    }
  ]
}
